probleemstelling/tekst.tex
% Created 2014-11-24 Mon 12:17
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Ward Schodts, Xavier Goás Aguililla}
\date{maandag 10 november 2014}
\title{Internet of Things code deployment metrics: probleemstelling}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\section{}
\label{sec-1}
\begin{itemize}
\item Observatie
\end{itemize}
In WSNs wordt weinig gebruik gemaakt van de ingebedde rekenkracht en
opslagcapaciteit van de sensor nodes.
\begin{itemize}
\item Vraagstelling
\end{itemize}
Zou het mogelijk zijn om een andere aanpak te gebruiken, d.i. meer
berekeningen uit te voeren en meer data op te slaan op de sensor nodes
zelf, zonder verlies van performantie of energie-efficiëntie?
\begin{itemize}
\item Waarom
\end{itemize}
Als dit mogelijk was dan zouden we minder gebruik moeten maken van de
RF-antennes, die veel energie verbruiken. Eventueel kan dit zelfs ook
betere performantie opleveren, omdat er dan minder data over het
netwerk zou moeten overgedragen worden.
\begin{itemize}
\item Hypothese
\end{itemize}
Wij denken dat in bepaalde scenario's het beter is om bewerkingen op
de sensor nodes uit te voeren voor een efficiënter energiegebruik en
misschien zelfs betere performantie.
\begin{itemize}
\item Bewijs
\end{itemize}
Metingen die aantonen dat voor een gelijkaardige fysieke setup een
andere verdeling van de werklast binnen het WSN voordelen oplevert qua
energieverbruik en/of performantie vis-à-vis een klassiekere
werkverdeling.
\begin{itemize}
\item Vereisten
\end{itemize}
Het ontwikkelen van een tool die toelaat om de potentiële
energie-efficiëntie en performantie van een WSN te meten op basis
van welke types code (bv. adhv. vooraf gebenchmarkte API calls) waar
worden uitgevoerd.
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}